## Staging: common
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 20 to add, 0 to change, 0 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.vpc_endpoints will be created
  + resource "aws_security_group" "vpc_endpoints" {
      + arn                    = (known after apply)
      + description            = "PrivateLink VPC endpoints"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "vpc_endpoints"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-097508d1f5e243195"
    }

  # aws_vpc_endpoint.gateway["s3"] will be created
  + resource "aws_vpc_endpoint" "gateway" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = [
          + "rtb-03acf60dc1b7b3b3d",
          + "rtb-0b0d8a54c7f220050",
          + "rtb-0c13c612f5ec33d12",
        ]
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ca-central-1.s3"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = "vpc-097508d1f5e243195"
    }

  # aws_vpc_endpoint.interface["ecr.api"] will be created
  + resource "aws_vpc_endpoint" "interface" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ca-central-1.ecr.api"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-001e585d12cce4d1e",
          + "subnet-08de34a9e1a7458dc",
          + "subnet-0af8b8402f1d605ff",
        ]
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-097508d1f5e243195"
    }

  # aws_vpc_endpoint.interface["ecr.dkr"] will be created
  + resource "aws_vpc_endpoint" "interface" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ca-central-1.ecr.dkr"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-001e585d12cce4d1e",
          + "subnet-08de34a9e1a7458dc",
          + "subnet-0af8b8402f1d605ff",
        ]
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-097508d1f5e243195"
    }

  # aws_vpc_endpoint.interface["elasticache"] will be created
  + resource "aws_vpc_endpoint" "interface" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ca-central-1.elasticache"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-001e585d12cce4d1e",
          + "subnet-08de34a9e1a7458dc",
          + "subnet-0af8b8402f1d605ff",
        ]
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-097508d1f5e243195"
    }

  # aws_vpc_endpoint.interface["elasticache-fips"] will be created
  + resource "aws_vpc_endpoint" "interface" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ca-central-1.elasticache-fips"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-001e585d12cce4d1e",
          + "subnet-08de34a9e1a7458dc",
          + "subnet-0af8b8402f1d605ff",
        ]
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-097508d1f5e243195"
    }

  # aws_vpc_endpoint.interface["email-smtp"] will be created
  + resource "aws_vpc_endpoint" "interface" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ca-central-1.email-smtp"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-001e585d12cce4d1e",
          + "subnet-08de34a9e1a7458dc",
          + "subnet-0af8b8402f1d605ff",
        ]
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-097508d1f5e243195"
    }

  # aws_vpc_endpoint.interface["events"] will be created
  + resource "aws_vpc_endpoint" "interface" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ca-central-1.events"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-001e585d12cce4d1e",
          + "subnet-08de34a9e1a7458dc",
          + "subnet-0af8b8402f1d605ff",
        ]
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-097508d1f5e243195"
    }

  # aws_vpc_endpoint.interface["evidently"] will be created
  + resource "aws_vpc_endpoint" "interface" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ca-central-1.evidently"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-001e585d12cce4d1e",
          + "subnet-08de34a9e1a7458dc",
          + "subnet-0af8b8402f1d605ff",
        ]
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-097508d1f5e243195"
    }

  # aws_vpc_endpoint.interface["evidently-dataplane"] will be created
  + resource "aws_vpc_endpoint" "interface" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ca-central-1.evidently-dataplane"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-001e585d12cce4d1e",
          + "subnet-08de34a9e1a7458dc",
          + "subnet-0af8b8402f1d605ff",
        ]
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-097508d1f5e243195"
    }

  # aws_vpc_endpoint.interface["lambda"] will be created
  + resource "aws_vpc_endpoint" "interface" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ca-central-1.lambda"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-001e585d12cce4d1e",
          + "subnet-08de34a9e1a7458dc",
          + "subnet-0af8b8402f1d605ff",
        ]
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-097508d1f5e243195"
    }

  # aws_vpc_endpoint.interface["logs"] will be created
  + resource "aws_vpc_endpoint" "interface" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ca-central-1.logs"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-001e585d12cce4d1e",
          + "subnet-08de34a9e1a7458dc",
          + "subnet-0af8b8402f1d605ff",
        ]
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-097508d1f5e243195"
    }

  # aws_vpc_endpoint.interface["monitoring"] will be created
  + resource "aws_vpc_endpoint" "interface" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ca-central-1.monitoring"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-001e585d12cce4d1e",
          + "subnet-08de34a9e1a7458dc",
          + "subnet-0af8b8402f1d605ff",
        ]
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-097508d1f5e243195"
    }

  # aws_vpc_endpoint.interface["rds"] will be created
  + resource "aws_vpc_endpoint" "interface" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ca-central-1.rds"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-001e585d12cce4d1e",
          + "subnet-08de34a9e1a7458dc",
          + "subnet-0af8b8402f1d605ff",
        ]
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-097508d1f5e243195"
    }

  # aws_vpc_endpoint.interface["rum"] will be created
  + resource "aws_vpc_endpoint" "interface" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ca-central-1.rum"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-001e585d12cce4d1e",
          + "subnet-08de34a9e1a7458dc",
          + "subnet-0af8b8402f1d605ff",
        ]
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-097508d1f5e243195"
    }

  # aws_vpc_endpoint.interface["rum-dataplane"] will be created
  + resource "aws_vpc_endpoint" "interface" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ca-central-1.rum-dataplane"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-001e585d12cce4d1e",
          + "subnet-08de34a9e1a7458dc",
          + "subnet-0af8b8402f1d605ff",
        ]
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-097508d1f5e243195"
    }

  # aws_vpc_endpoint.interface["secretsmanager"] will be created
  + resource "aws_vpc_endpoint" "interface" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ca-central-1.secretsmanager"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-001e585d12cce4d1e",
          + "subnet-08de34a9e1a7458dc",
          + "subnet-0af8b8402f1d605ff",
        ]
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-097508d1f5e243195"
    }

  # aws_vpc_endpoint.interface["sns"] will be created
  + resource "aws_vpc_endpoint" "interface" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ca-central-1.sns"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-001e585d12cce4d1e",
          + "subnet-08de34a9e1a7458dc",
          + "subnet-0af8b8402f1d605ff",
        ]
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-097508d1f5e243195"
    }

  # aws_vpc_endpoint.interface["sqs"] will be created
  + resource "aws_vpc_endpoint" "interface" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ca-central-1.sqs"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-001e585d12cce4d1e",
          + "subnet-08de34a9e1a7458dc",
          + "subnet-0af8b8402f1d605ff",
        ]
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-097508d1f5e243195"
    }

  # aws_vpc_endpoint.interface["synthetics"] will be created
  + resource "aws_vpc_endpoint" "interface" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ca-central-1.synthetics"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-001e585d12cce4d1e",
          + "subnet-08de34a9e1a7458dc",
          + "subnet-0af8b8402f1d605ff",
        ]
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-097508d1f5e243195"
    }

Plan: 20 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + private-links-gateway-prefix-list-ids     = [
      + (known after apply),
    ]
  + private-links-vpc-endpoints-securitygroup = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.primary"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.aws_health"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.route53_resolver_query_log"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.ses_receiving_emails"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures_us_west_2"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_us_west_2"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.contact-3-500-error-15-minutes-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.document-download-bucket-size-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.expired-email-created-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.expired-email-created-warning"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
